/**
 * ㅡㅡ핵심키워드
 * 연산자
 * 
 * ㅡㅡ개요
 * 산술연산자
 * 1. 이항 산술 연산자(+, -, *, /, %)
 * 2. 단항 산술 연산자(++, --, +, -)
 * 3. 문자열 연결 연산자(+)
 * 
 * 할당 연선자
 * (=, +=, -=, *=, /=, %=)
 * 
 * 비교 연산자
 * 1. 동등비교(==, !=)
 * 2. 일치비교(===, !==) 권장
 * 3. 대소비교(>, >=, <, <=)
 * 
 * 삼항 조건 연산
 * var result = (score >= 60) ? `pass` : `fail`;
 * 첫번째 피연산자가 true면 `pass`, false면 `fail`
 * 
 * 논리 연산자
 * (||, &&, !)
 * 
 * 쉼표 연산자
 * var x, y, z;
 * 
 * 그룹 연산자
 * var result = 10 * (2 + 1);
 * 
 * typeof 연산자
 * number boolean undefined symbol object function 중 하나 반환
 * 단 null확인시에는 typeof 사용하지말고 일치연산(===) 사용할것
 * typeof null => object
 * 
 * 지수 연산자
 * (**) 제곱
 * 
 * 기타 연산자
 * ?. 옵셔널체이닝
 * ?? null병합
 * delete 프로퍼티삭제
 * new 생성자 함수를 호출할때 사용해 인스턴스 생성
 * instanceof 좌변의 객체가 우변의 생선자 함수와 연결된 인스턴스인지 판별
 * in 프로퍼티 존재확인
 */
